# TRANSFORMATION CODE
by Hakob Antonian, Vito Perez, Gerard Tieng

In [1]:
#import dependencies
import pandas as pd
import numpy as mp
import datetime as dt

# TRANSFORM STATS

In [2]:
#read first stats table into pandas
stats = pd.read_excel('nba_stats.xlsx', header=1)

In [3]:
#drop unnecessary columns
stats_colsdrop=[0, 7, 8, 16, 17, 26, 27, 28]
statsV2 = stats.drop(stats.columns[stats_colsdrop], axis=1)

In [4]:
#rename long columns
statsV3 = statsV2.rename(
    {statsV2.columns[6]:"TOR%",
    statsV2.columns[13]:"PPG",
    statsV2.columns[14]:"RPG",
    statsV2.columns[15]:"TRB%",
    statsV2.columns[16]:"APG",
    statsV2.columns[17]:"AST%",
    statsV2.columns[18]:"SPG",
    statsV2.columns[19]:"BPG",
    statsV2.columns[20]:"TOPG"}, axis=1)

#uppercase team abbrev.
statsV3["TEAM"] = statsV3["TEAM"].str.upper()
statsV3 = statsV3.rename(columns={"FULL NAME": "NAME"})

In [5]:
#sort by full name and reset index for key
statsV3 = statsV3.sort_values(by=["NAME", "TEAM"])
statsV3 = statsV3.reset_index(drop=True)

In [33]:
statsV3.head()

,NAME,TEAM,POS,AGE,GP,MPG,TOR%,FTA,FT%,2PA,...,3PA,3P%,PPG,RPG,TRB%,APG,AST%,SPG,BPG,TOPG
0,Aaron Gordon,ORL,F,23.57,78,33.8,12.3,253,0.731,699,...,347,0.349,16.0,7.3,11.7,3.7,16.6,0.73,0.72,2.08
1,Aaron Holiday,IND,G,22.53,50,12.9,12.3,50,0.820,135,...,127,0.339,5.9,1.3,5.7,1.7,19.3,0.40,0.26,0.80
2,Abdel Nader,OKC,F,25.54,61,11.4,10.1,36,0.750,115,...,100,0.320,4.0,1.9,8.6,0.3,3.8,0.33,0.20,0.43
3,Al Horford,BOS,F-C,32.86,68,29.0,11.8,97,0.825,520,...,203,0.360,13.6,6.7,12.4,4.1,21.1,0.85,1.26,1.50
4,Al-Farouq Aminu,POR,F,28.55,81,28.3,9.7,173,0.867,313,...,280,0.343,9.4,7.5,14.2,1.3,6.0,0.84,0.41,0.89

# TRANSFORM PLAYER INFO

In [7]:
#read info CSV
info = pd.read_csv('nba_playerinfo.csv')

In [8]:
#drop unecessary columns
info_colsdrop = [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 21]
infoV2 = info.drop(info.columns[info_colsdrop], axis=1)

In [9]:
#convert birthdates to datetime
infoV2['birthDate'] = pd.to_datetime(infoV2['birthDate'])

In [10]:
#eliminate records of players older than the oldest active player, Vince Carter
infoV3 = infoV2[(infoV2['birthDate'] >= '1977-01-26')]

In [11]:
#reorder columns
infoV3 = infoV3[['_id',
                 'name',
                'height', 
                'weight', 
                'shoots',
                'birthDate',
                'birthPlace',
                'college',
                'highSchool',
                'draft_team',
                'draft_pick',
                'draft_round',
                'draft_year']]

infoV3 = infoV3.sort_values(by=['name'])
infoV3 = infoV3.reset_index(drop=True)

In [35]:
#final info table
infoV3.head()

,_id,name,height,weight,shoots,birthDate,birthPlace,college,highSchool,draft_team,draft_pick,draft_round,draft_year
0,guytoaj01,A.J. Guyton,6-1,180lb,Right,1978-02-12,"Peoria, Illinois",Indiana University,"Central in Peoria, Illinois",Chicago Bulls,32nd overall,2nd round,2000
1,hammoaj01,A.J. Hammons,7-0,260lb,Right,1992-08-27,"Gary, Indiana",Purdue University,"Oak Hill Academy in Mouth of Wilson, Virginia",Dallas Mavericks,46th overall,2nd round,2016
2,priceaj01,A.J. Price,6-2,181lb,Right,1986-10-07,"Orange, New Jersey",University of Connecticut,"Amityville Memorial in Amityville, New York",Indiana Pacers,52nd overall,2nd round,2009
3,brookaa01,Aaron Brooks,6-0,161lb,Right,1985-01-14,"Seattle, Washington",University of Oregon,"Franklin in Seattle, Washington",Houston Rockets,26th overall,1st round,2007
4,gordoaa01,Aaron Gordon,6-9,220lb,Right,1995-09-16,"San Jose, California",University of Arizona,"Archbishop Mitty in San Jose, California",Orlando Magic,4th overall,1st round,2014

# TRANSFORM PLAYER TATTOOS

In [13]:
#load tattoos csv
tattoos = pd.read_csv('nba_tattoos.csv')

In [14]:
#clean up column names
tattoos = tattoos.rename(columns={'Player Name': 'name', "Tattoos yes/no": "tattoo"})

In [15]:
#inspect final table
tattoos.head()

           name tattoo
0    A.J. Price     no
1    Aaron Gray     no
2    Al Horford     no
3  Al Jefferson     no
4   Al Thornton     no

# TRANSFORM SALARIES

In [16]:
#load salaries csv
salaries = pd.read_csv('nba_salaries.csv')

In [17]:
#drop unecessary columns
salaries = salaries.drop(columns=['league', "season_start", "season"])

In [18]:
#subset data to most recent season
salaries = salaries[(salaries['season_end'] == 2018)]

In [19]:
#reset index for cleanliness
salaries = salaries.reset_index(drop=True)

In [20]:
salaries.head()

   player_id    salary  season_end                   team
0  abrinal01   5725000        2018  Oklahoma City Thunder
1    acyqu01   1709538        2018          Brooklyn Nets
2  adamsst01  22471910        2018  Oklahoma City Thunder
3  adebaba01   2490360        2018             Miami Heat
4  afflaar01   1500000        2018       Sacramento Kings

# TRANSFORM NUMBERS

In [21]:
#load numbers csv
numbers = pd.read_csv('nba_playernumbers.csv')

In [22]:
#change player number to string to preserve '00' in numeric conversion
numbers['player_number'] = numbers['player_number'].astype(str)

#cleanup columns
numbers = numbers.drop(columns='Unnamed: 0')

In [23]:
#inspect final table
numbers.head()

           player_name player_number player_team
0         Corey Brewer             0         PHI
1  Willie Cauley-Stein             0         SAC
2         Aaron Gordon             0         ORL
3          Enes Kanter             0         NYK
4          Enes Kanter             0         POR

# JOIN ALL TABLES

In [24]:
#merge largest table (info) with salaries on unique ID
mergeV1 = infoV3.merge(salaries, how='left', left_on='_id', right_on='player_id').drop(columns=['season_end', "team"])

In [25]:
#merge info/salaries + second largest table (stats)
mergeV2 = statsV3.merge(mergeV1, how='left', left_on='NAME', right_on='name').drop(columns=['name'])

In [26]:
#merge info/salaries + next largest table (numbers)
mergeV3 = mergeV2.merge(numbers, how='left', left_on=['NAME', 'TEAM'], right_on=['player_name', 'player_team']).drop(columns=['player_name', 'player_team'])

In [27]:
#merge info/salaries/numbers + tattoo)
mergeV4 = mergeV3.merge(tattoos, how='left', left_on='NAME', right_on='name').drop(columns=['name'])

In [28]:
#cleanup column names
mergeV4.columns = map(str.lower, mergeV4.columns)

In [30]:
#final inspection
mergeV4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 643 entries, 0 to 642
Data columns (total 37 columns):
name             643 non-null object
team             643 non-null object
pos              643 non-null object
age              643 non-null float64
gp               643 non-null int64
mpg              643 non-null float64
tor%             637 non-null float64
fta              643 non-null int64
ft%              643 non-null float64
2pa              643 non-null int64
2p%              643 non-null float64
3pa              643 non-null int64
3p%              643 non-null float64
ppg              643 non-null float64
rpg              643 non-null float64
trb%             643 non-null float64
apg              643 non-null float64
ast%             643 non-null float64
spg              643 non-null float64
bpg              643 non-null float64
topg             643 non-null float64
_id              613 non-null object
height           613 non-null object
weight           613 non-null object
shoots           613 non-null object
birthdate        613 non-null datetime64[ns]
birthplace       613 non-null object
college          521 non-null object
highschool       537 non-null object
draft_team       469 non-null object
draft_pick       469 non-null object
draft_round      469 non-null object
draft_year       469 non-null object
player_id        475 non-null object
salary           475 non-null float64
player_number    482 non-null object
tattoo           252 non-null object
dtypes: datetime64[ns](1), float64(15), int64(4), object(17)
memory usage: 190.9+ KB

In [29]:
#export to csv
finaldata = mergeV4
finaldata_export = mergeV4.to_csv('finaldata.csv')

# INSERT TO SQL

In [ ]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

In [ ]:
finaldata.to_sql('nba2018', con=engine)